data-processor-excel-scripts-and-calculations/ssl/InformationRegisters/ВремяИзготовленияПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяИзготовленияПродукции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цехи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

data-processor-excel-scripts-and-calculations/ssl/CommonModules/ФункцииПроизводства/Ext/Module.bsl
// <Описание функции>
//
// Параметры:
//  Продукт	     -  ссылка на справочник Продукция
// Возвращаемое значение: суммированное число из регистра сведений ВремяИзготовленияПродукции 
//
Функция ПолучитьОбщееВремяИзготовления(Продукт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВремяИзготовленияПродукции.Время) КАК ОбщееВремя
	|ИЗ
	|	РегистрСведений.ВремяИзготовленияПродукции КАК ВремяИзготовленияПродукции
	|ГДЕ
	|	ВремяИзготовленияПродукции.Продукция = &Продукт";
	Запрос.УстановитьПараметр("Продукт", Продукт);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Возвращаем суммарное время
		Возврат Выборка.ОбщееВремя;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции     
 

Функция РассчитатьКоличествоСырья(ТипПродукции, ТипМатериала, КоличествоПродукции, Параметр1, Параметр2) Экспорт 
	
	// Проверка входных значений
    Если КоличествоПродукции <= 0 ИЛИ Параметр1 <= 0 ИЛИ Параметр2 <= 0 Тогда
        Возврат -1;
    КонецЕсли;    // Получаем коэффициент типа продукции (вещественное число)
    Коэффициент = Справочники.ТипыПродукции.НайтиПоНаименованию(ТипПродукции).КоэффициентТипаПродукции;
    Если Коэффициент < 0 Тогда
        Возврат -1;
    КонецЕсли;

    // Получаем процент потерь сырья для типа материала (вещественное число)
    Потери = Справочники.ТипыМатериалов.НайтиПоНаименованию(ТипМатериала).ПроцентПотерьСырья;
    Если Потери < 0 Тогда
        Возврат -1;
    КонецЕсли;

    // Рассчитываем количество сырья на 1 единицу продукции
    КоличествоНаЕдиницу = Параметр1 * Параметр2 * Коэффициент;

    // Учитываем потери сырья (увеличиваем количество)
   
    ОбщееКоличество = КоличествоПродукции * КоличествоНаЕдиницу * Потери;

    // Возвращаем целое количество, округляя вверх, т.к. сырья нужно не меньше чем посчитано
    Возврат Цел(ОбщееКоличество);

КонецФункции



// <Описание функции>
//
// Параметры:
//  Источник	     -  ссылка на справочник Продукция
//  Обновляет данные справочника, исходя из проведения документа Производство 
//

Процедура ПодпискаНаСобытие1ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Проверим, что ссылка есть
	Если Источник.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем продукт из документа "Производство"
	Продукт = Источник.Продукт;
	
	Если Продукт.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем общее время изготовления через функцию
	ОбщееВремя = ФункцииПроизводства.ПолучитьОбщееВремяИзготовления(Продукт);
	
	// Получаем объект справочника Продукция
	ОбъектПродукта = Продукт.ПолучитьОбъект();
	
	// Обновляем реквизит
	ОбъектПродукта.ВремяИзготовления = ОбщееВремя;
	
	// Сохраняем изменения
	ОбъектПродукта.Записать();
КонецПроцедуры       


Функция РассчитатьКоличествоСырья1(ТипПродукции, ТипМатериала,КоличествоПродукции, Коэффициент, ПроцентБрака) Экспорт 
	
	Если ТипЗнч(ТипПродукции) <> Тип("СправочникСсылка.ТипыПродукции") ИЛИ НЕ ЗначениеЗаполнено(ТипПродукции) Тогда
		Возврат 1;
		
	КонецЕсли;
	
	Если ТипЗнч(ТипМатериала) <> Тип("СправочникСсылка.ТипыМатериалов") ИЛИ НЕ ЗначениеЗаполнено(ТипМатериала) Тогда
		Возврат 1;
	КонецЕсли;
	
	Если ТипЗнч(Коэффициент) <> Тип("Число") Тогда
		Возврат 1;
	КонецЕсли;
	Если ТипЗнч(ПроцентБрака) <> Тип("Число") Тогда
		Возврат 1;
	КонецЕсли;
	
	Попытка
	
		Результат = КоличествоПродукции * Коэффициент / 100 * (100 + ПроцентБрака);
		
		Если Результат <> Цел(Результат) Тогда
			Результат = Цел(Результат + 1);
		КонецЕсли
	
	Исключение   
		Возврат 1;
	
	КонецПопытки;   
	
	Если КоличествоПродукции <> Цел(КоличествоПродукции) Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
